{
  "backend/main.mo": "Main Motoko actor for the sleep tracking backend, defining data types (blink rates, vibration events, blink summaries, user profiles) and CRUD operations with role-based access control via MixinAuthorization and AccessControl modules.",
  "feature_evidence.json": "Feature evidence report mapping two BLE battery features to their implementation files and test IDs, covering battery data parsing in the Bluetooth context and the battery indicator UI widget on the Dashboard.",
  "frontend-file-summaries.txt": "JSON document containing one-sentence summaries of all frontend source files, serving as a reference index for the project's React components, hooks, pages, and configuration files.",
  "frontend/index.css": "Global Tailwind CSS entry point defining OKLCH-based CSS custom properties for the design system's color tokens in both light and dark modes.",
  "frontend/index.html": "HTML entry point for the Vite/React app, mounting the root div and loading the main TypeScript module for the sleep schedule application.",
  "frontend/src/App.tsx": "Root React component that sets up TanStack Router with routes for Dashboard, DeviceConnection, DeviceDataIngestion, and SmokeTest pages, all wrapped in BluetoothProvider.",
  "frontend/src/components/actor/ActorBootstrap.tsx": "Deprecated wrapper component that previously initialized the ICP actor but now simply renders its children, as the app has moved to a local-first architecture.",
  "frontend/src/components/auth/AuthGate.tsx": "Landing page shown to unauthenticated users featuring a hero layout with app branding, feature highlights, and an Internet Identity login button.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button component that handles Internet Identity authentication, clearing the React Query cache on logout.",
  "frontend/src/components/charts/BlinkRateChart.tsx": "A canvas-based chart component that renders blink rate history over time with loading and empty states. Displays a line graph with data points, axis labels, and a 3-second loading timeout.",
  "frontend/src/components/charts/BlinkSummaryHistory.tsx": "Empty file with no content.",
  "frontend/src/components/charts/VibrationEventsChart.tsx": "Empty file with no content.",
  "frontend/src/components/device/BatteryIndicator.tsx": "A card component that displays device battery percentage and charging status using dynamic icons, a progress bar, and color-coded text based on charge level.",
  "frontend/src/components/device/DeviceSelector.tsx": "A card component with an input field for entering an ESP32-C3 device ID and a link button to navigate to the device management page.",
  "frontend/src/components/docs/ApiExamples.tsx": "Displays tabbed code examples (JavaScript and cURL) for three API operations—recording blink rates, vibration events, and querying blink data—with copy-to-clipboard functionality.",
  "frontend/src/components/layout/AppHeader.tsx": "Sticky top navigation header with the app logo/title and links to Dashboard, Devices, API Docs, and Smoke Test routes.",
  "frontend/src/components/layout/AppLayout.tsx": "Root layout component that wraps all pages with the AppHeader, a main content outlet, and a footer.",
  "frontend/src/components/profile/ProfileSetupDialog.tsx": "A deprecated, always-hidden dialog component for profile setup that is kept for compatibility but performs no actions in local-first mode.",
  "frontend/src/components/recommendation/SleepScheduleCard.tsx": "A card that shows the user's current live alertness state (high-alertness, normal, or drowsy) based on a 5-minute rolling blink average and provides a button to generate a personalized sleep schedule.",
  "frontend/src/components/time/TimeRangePicker.tsx": "A card with a dropdown selector for choosing a time range (6h, 24h, 7d, 30d) and a utility function to convert the selected range into nanosecond timestamps.",
  "frontend/src/contexts/BluetoothContext.tsx": "React context provider that manages BLE device connection state, handles GATT characteristic notifications, parses blink rate and battery data from NUS service, and tracks eye state using calibrated light-level thresholds to compute a rolling 60-second blink rate.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an ICP backend actor (authenticated or anonymous) using React Query, initializing access control with an admin token and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useActorBootstrap.ts": "Deprecated stub hook that previously handled actor initialization; now returns static no-op state since the app is fully local-first.",
  "frontend/src/hooks/useBleWriteQueue.ts": "Deprecated stub hook that previously queued BLE writes to the backend; now returns no-op state since the app is fully local-first.",
  "frontend/src/hooks/useBlinkSummaryFlush.ts": "Deprecated stub hook that previously flushed blink summaries to the backend; now a no-op since persistence is handled via localStorage.",
  "frontend/src/hooks/useCurrentUserProfile.ts": "Custom hook that fetches the current authenticated user's profile from the ICP backend actor using React Query, gating the query on actor availability.",
  "frontend/src/hooks/useDeviceId.ts": "Custom hook that manages a device ID string persisted in localStorage, exposing get/set helpers and a validity flag.",
  "frontend/src/hooks/useEyeRBluetooth.ts": "Standalone hook (parallel to BluetoothContext) that manages BLE connection lifecycle, parses NUS notifications for blink rate and battery data, and exposes connection state and latest readings.",
  "frontend/src/hooks/useInternetIdentity.ts": "Custom hook and provider that wraps DFINITY's AuthClient to manage Internet Identity login/logout lifecycle, persisting identity across page reloads and exposing login status flags.",
  "frontend/src/hooks/useLocalBlinkHistory.ts": "Custom hook that maintains a capped (1000-point) blink rate history array persisted to localStorage, with add and clear operations.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for reading and writing blink rates, vibration events, blink summaries, and user profiles via the ICP backend actor.",
  "frontend/src/hooks/useRecordBlinkRateWithQueue.ts": "Empty file with no implementation.",
  "frontend/src/hooks/useRollingBlinkRateAverage5Min.ts": "Custom hook that maintains an in-memory list of timestamped blink rate points and computes a rolling 5-minute average, pruning stale entries on each update.",
  "frontend/src/hooks/useSessionBlinkRateHistory.ts": "Custom hook that tracks an in-memory, session-only blink rate history capped at 100 points, with add and clear operations.",
  "frontend/src/index.css": "Global CSS file that imports Tailwind directives and defines CSS custom properties for a calm, sleep-focused color palette in both light and dark modes.",
  "frontend/src/main.tsx": "React app entry point that wraps the App component with QueryClientProvider and InternetIdentityProvider before mounting to the DOM.",
  "frontend/src/pages/Dashboard.tsx": "Main dashboard page that displays real-time blink rate data from Bluetooth-connected glasses, a rolling 5-minute average, historical charts, and a personalized sleep schedule generator.",
  "frontend/src/pages/DeviceConnection.tsx": "Page for managing Bluetooth device connections, allowing users to connect/disconnect Eye-R smart glasses and configure custom BLE service/characteristic UUIDs.",
  "frontend/src/pages/DeviceDataIngestion.tsx": "Documentation page describing the API for submitting ESP32-C3 telemetry data (blink rates, timestamps) to the backend canister, including field descriptions and API examples.",
  "frontend/src/pages/SmokeTest.tsx": "Diagnostic page that verifies frontend-to-backend canister connectivity by testing Internet Identity authentication status and calling basic actor methods.",
  "frontend/src/types/bluetooth.d.ts": "TypeScript type declarations for the Web Bluetooth API, covering GATT server, service, characteristic, and descriptor interfaces along with request/scan filter options.",
  "frontend/src/utils/bleNus.ts": "Provides Nordic UART Service (NUS) UUIDs and parsing utilities for extracting blink rate, eye state tokens, and battery data from BLE notification payloads encoded as UTF-8 text.",
  "frontend/src/utils/bleUuid.ts": "Utility functions to normalize BLE UUIDs into Web Bluetooth compatible formats (16-bit strings to numbers, 128-bit strings unchanged) and format them for display.",
  "frontend/src/utils/bleWriteQueue.ts": "Manages a localStorage-backed queue for pending BLE blink rate write operations, with functions to enqueue, retrieve, remove, and clear queued items.",
  "frontend/src/utils/localSleepSchedule.ts": "Generates local sleep and rest recommendations by analyzing the last 100 blink rate data points from session history, considering average BPM, variability, and current time of day.",
  "frontend/src/utils/personalizedSleepSchedule.ts": "Derives an alertness state (high-alertness, normal, or drowsy) from a rolling average BPM and returns a corresponding personalized schedule plan with actionable items.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, persisting, and clearing URL parameters from both query strings and hash-based routing, with sessionStorage fallback support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom design tokens (colors via OKLCH, border radius, fonts, shadows, animations) and enabling the typography, container-queries, and animate plugins.",
  "project_state.json": "Tracks the project state for EyeR Monitor, listing existing implemented features (BLE battery parsing and dashboard battery widget) and a pending feature request to display battery percentage on the dashboard."
}