{
  "backend/main.mo": "Main Motoko actor for the sleep tracking app managing blink rate measurements, vibration events, rolling averages, sleep recommendations, and user profiles with role-based access control via a MixinAuthorization mixin.",
  "backend/migration.mo": "Migration module that initializes new actor state fields `lastEyeClosedTimestamp` and `mostRecentActuationLatency` as null when upgrading from the old actor shape.",
  "feature_evidence.json": "Feature evidence report mapping two features—BLE eye-closed/vibration backend integration and the Actuation Latency dashboard card—to their implementing files, components, and test IDs.",
  "frontend-file-summaries.txt": "Precomputed one-line summaries for all frontend source files, describing each component, hook, page, and config file's purpose in the sleep tracking application.",
  "frontend/index.css": "Global Tailwind CSS entry point defining OKLCH-based CSS custom properties for the full design token system in both light and dark modes.",
  "frontend/index.html": "HTML shell for the Vite/React app, setting the page title to the sleep schedule app description and mounting the React root via `src/main.tsx`.",
  "frontend/src/App.tsx": "Root React component that configures TanStack Router with routes for Dashboard, DeviceConnection, DeviceDataIngestion, and SmokeTest pages, all wrapped in BluetoothProvider.",
  "frontend/src/components/actor/ActorBootstrap.tsx": "Deprecated passthrough wrapper component that previously initialized the ICP actor but now simply renders its children in local-first mode.",
  "frontend/src/components/auth/AuthGate.tsx": "Landing page shown to unauthenticated users featuring hero image, feature highlights, and an Internet Identity login button.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button that uses Internet Identity for authentication and clears the React Query cache on logout.",
  "frontend/src/components/charts/BlinkRateChart.tsx": "A canvas-based chart component that renders blink rate history over time with loading and empty states. Displays data points and a line graph with min/max rate labels.",
  "frontend/src/components/charts/BlinkSummaryHistory.tsx": "Empty file with no content.",
  "frontend/src/components/charts/VibrationEventsChart.tsx": "Empty file with no content.",
  "frontend/src/components/device/ActuationLatencyCard.tsx": "A card component that displays the eye-closed-to-vibration actuation latency in milliseconds, fetched via the useActuationLatency hook with a skeleton loading state.",
  "frontend/src/components/device/BatteryIndicator.tsx": "A card component showing battery percentage and charging status with a progress bar, color-coded icons, and badges based on battery level thresholds.",
  "frontend/src/components/device/DeviceSelector.tsx": "A card component with an input for entering an ESP32-C3 device ID and a link button to navigate to the device management page.",
  "frontend/src/components/docs/ApiExamples.tsx": "A documentation component displaying JavaScript and cURL code examples for recording blink rates, vibration events, and querying blink data, with copy-to-clipboard functionality.",
  "frontend/src/components/layout/AppHeader.tsx": "A sticky top navigation header with the Eye-R app logo and links to Dashboard, Devices, API Docs, and Smoke Test routes.",
  "frontend/src/components/layout/AppLayout.tsx": "Root layout component that wraps all pages with the AppHeader, a main content outlet, and a footer.",
  "frontend/src/components/profile/ProfileSetupDialog.tsx": "A deprecated, always-hidden dialog component for profile setup that is kept for compatibility but performs no actions in local-first mode.",
  "frontend/src/components/recommendation/SleepScheduleCard.tsx": "A card component that displays the user's current alertness state based on a 5-minute rolling blink average and allows generating a personalized sleep schedule recommendation.",
  "frontend/src/components/time/TimeRangePicker.tsx": "A card component with a dropdown selector for choosing a time range (6h, 24h, 7d, 30d) and a utility function to convert the selection into nanosecond timestamps.",
  "frontend/src/contexts/BluetoothContext.tsx": "React context provider that manages BLE device connection, parses NUS notifications for blink rate and battery data, tracks eye state using calibrated light-level thresholds, persists blink history locally, and exposes a vibration trigger with backend latency recording.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an ICP backend actor (authenticated or anonymous) using React Query, initializes access control with an admin token, and invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useActorBootstrap.ts": "Deprecated stub hook that previously handled actor initialization; now returns static no-op state since the app is fully local-first.",
  "frontend/src/hooks/useBleWriteQueue.ts": "Deprecated stub hook that previously queued BLE writes to the backend; now returns no-op state since the app is fully local-first.",
  "frontend/src/hooks/useBlinkSummaryFlush.ts": "Deprecated stub hook that previously flushed blink summaries to the backend; now a no-op since persistence is handled locally via localStorage.",
  "frontend/src/hooks/useCurrentUserProfile.ts": "Custom hook that fetches the authenticated caller's user profile from the ICP backend actor using React Query, gating the query on actor availability.",
  "frontend/src/hooks/useDeviceId.ts": "Custom hook that reads and persists a device ID string to localStorage, exposing state, a setter, and a validity flag.",
  "frontend/src/hooks/useEyeRBluetooth.ts": "Custom hook that manages BLE device connection and parses NUS characteristic notifications for blink rate and battery data using multiple fallback parsing strategies.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity authentication context and hook, wrapping DFINITY's AuthClient to handle login, logout, identity persistence, and delegation validation.",
  "frontend/src/hooks/useLocalBlinkHistory.ts": "Custom hook that maintains an in-memory and localStorage-persisted array of blink rate data points (up to 1000), with add and clear operations.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for reading and writing blink rates, vibration events, blink summaries, user profiles, and actuation latency via the ICP backend actor.",
  "frontend/src/hooks/useRecordBlinkRateWithQueue.ts": "Empty file with no implementation.",
  "frontend/src/hooks/useRollingBlinkRateAverage5Min.ts": "Custom hook that maintains a rolling 5-minute window of blink rate data points and computes their average, with add and clear operations.",
  "frontend/src/hooks/useSessionBlinkRateHistory.ts": "React hook that maintains an in-memory history of blink rate data points (up to 100) with timestamps, exposing methods to add and clear entries.",
  "frontend/src/index.css": "Global CSS file that configures Tailwind CSS and defines a calm, sleep-focused design token palette for both light and dark themes using CSS custom properties.",
  "frontend/src/main.tsx": "Application entry point that renders the React app wrapped with React Query, Internet Identity, and the root App component.",
  "frontend/src/pages/Dashboard.tsx": "Main dashboard page that displays real-time blink rate data from Bluetooth, a rolling 5-minute average, historical charts with time range selection, and a personalized sleep schedule generator.",
  "frontend/src/pages/DeviceConnection.tsx": "Page for managing Bluetooth device connections, allowing users to configure UUIDs, connect/disconnect their Eye-R smart glasses, and view live blink rate readings.",
  "frontend/src/pages/DeviceDataIngestion.tsx": "Documentation page describing the telemetry ingestion API for ESP32-C3 smart glasses, including data field definitions and API usage examples.",
  "frontend/src/pages/SmokeTest.tsx": "Diagnostic page that verifies frontend-to-backend canister connectivity by testing Internet Identity authentication status and executing basic actor method calls.",
  "frontend/src/types/bluetooth.d.ts": "TypeScript type declarations for the Web Bluetooth API, covering GATT server, service, characteristic, and descriptor interfaces along with device request options.",
  "frontend/src/utils/bleNus.ts": "Defines Nordic UART Service UUIDs, eye-state light level thresholds, and utility functions to classify light readings into eye states and parse blink rate values from BLE NUS notifications.",
  "frontend/src/utils/bleUuid.ts": "Provides helper functions to normalize UUID strings/numbers into Web Bluetooth API-compatible formats and format them for display.",
  "frontend/src/utils/bleWriteQueue.ts": "Implements a localStorage-backed queue for pending BLE blink rate write operations, with enqueue, dequeue, remove, and clear functions.",
  "frontend/src/utils/localSleepSchedule.ts": "Generates local sleep recommendations by analyzing the last 100 blink rate data points, computing average BPM, and returning contextual advice based on fatigue thresholds and time of day.",
  "frontend/src/utils/personalizedSleepSchedule.ts": "Derives an alertness state (high-alertness, normal, drowsy) from a rolling average BPM and returns a corresponding personalized schedule plan with actionable items.",
  "frontend/src/utils/urlParams.ts": "Provides utilities to extract URL parameters from query strings and hash-based routes, persist them in sessionStorage, and clean sensitive parameters from the URL bar.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with dark mode, custom OKLCH color tokens, border radius, font family, box shadows, accordion keyframes, and plugins for typography, container queries, and animations.",
  "project_state.json": "Tracks the EyeR Sleep Monitor project state including existing features (BLE eye-closed/vibration latency integration, dashboard latency card) and pending feature requests for high-resolution backend actuation latency recording and retrieval endpoints."
}