{
  "backend/main.mo": "Main Motoko actor for the sleep tracking backend, defining data types and storage maps for blink rate measurements, vibration events, blink summaries, and user profiles, with role-based access control via MixinAuthorization.",
  "feature_evidence.json": "Empty feature evidence report JSON file with no features listed.",
  "frontend-file-summaries.txt": "JSON document containing one-line summaries of all frontend source files, describing each component, hook, and page in the application.",
  "frontend/index.css": "Global Tailwind CSS entry point defining OKLCH-based CSS custom properties for the design system's color tokens in both light and dark modes.",
  "frontend/index.html": "HTML entry point for the Vite/React app, mounting the root div and loading the main TSX module.",
  "frontend/src/App.tsx": "Root React component that sets up TanStack Router with routes for Dashboard, DeviceConnection, DeviceDataIngestion, and SmokeTest, all wrapped in BluetoothProvider.",
  "frontend/src/components/actor/ActorBootstrap.tsx": "Deprecated wrapper component that previously initialized the ICP actor but now simply renders its children as the app is local-first.",
  "frontend/src/components/auth/AuthGate.tsx": "Landing page shown to unauthenticated users featuring a hero image, feature highlights, and an Internet Identity login button.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button component that handles Internet Identity authentication and clears the React Query cache on logout.",
  "frontend/src/components/charts/BlinkRateChart.tsx": "Canvas-based line chart component that visualizes blink rate history over time, with a 3-second loading timeout and an empty state fallback.",
  "frontend/src/components/charts/BlinkSummaryHistory.tsx": "Empty file with no content.",
  "frontend/src/components/charts/VibrationEventsChart.tsx": "Empty file with no content.",
  "frontend/src/components/device/BatteryIndicator.tsx": "A card component that displays battery percentage and charging status with dynamic icons, color coding, and a progress bar based on battery level.",
  "frontend/src/components/device/DeviceSelector.tsx": "A card component with an input field for entering an ESP32-C3 device ID and a link button to navigate to the device management page.",
  "frontend/src/components/docs/ApiExamples.tsx": "A documentation component that displays JavaScript and cURL code examples for recording blink rates, vibration events, and querying data, with copy-to-clipboard functionality.",
  "frontend/src/components/layout/AppHeader.tsx": "A sticky top navigation header with the app logo and nav links to Dashboard, Devices, API Docs, and Smoke Test pages.",
  "frontend/src/components/layout/AppLayout.tsx": "The root layout component that wraps all pages with the AppHeader, a main content outlet, and a footer.",
  "frontend/src/components/profile/ProfileSetupDialog.tsx": "A deprecated, always-hidden dialog component for profile name setup that is kept for compatibility but no longer used in local-first mode.",
  "frontend/src/components/recommendation/SleepScheduleCard.tsx": "A card component that displays the current alertness state derived from blink rolling averages and allows generating a personalized sleep schedule recommendation.",
  "frontend/src/components/time/TimeRangePicker.tsx": "A card component with a dropdown to select a time range (6h, 24h, 7d, 30d) and a utility function to convert the selection into nanosecond timestamps.",
  "frontend/src/contexts/BluetoothContext.tsx": "A React context provider that manages BLE device connection state, parses incoming NUS characteristic data for blink rates and battery info, and tracks eye state using calibrated light-level thresholds.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an ICP backend actor using React Query, supporting both anonymous and authenticated (Internet Identity) usage, and invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useActorBootstrap.ts": "Deprecated stub hook that previously handled actor initialization; now a no-op as the app is fully local-first.",
  "frontend/src/hooks/useBleWriteQueue.ts": "Deprecated stub hook that previously queued BLE writes to the backend; now a no-op returning empty/false state.",
  "frontend/src/hooks/useBlinkSummaryFlush.ts": "Deprecated stub hook that previously flushed blink summaries to the backend; now a no-op since persistence is handled via localStorage.",
  "frontend/src/hooks/useCurrentUserProfile.ts": "Fetches the current authenticated user's profile from the backend actor using React Query, gating the query on actor availability.",
  "frontend/src/hooks/useDeviceId.ts": "Manages a device ID string in both React state and localStorage, providing get/set helpers and a validity flag.",
  "frontend/src/hooks/useEyeRBluetooth.ts": "Manages BLE connection lifecycle to an EyeR device, handling GATT service/characteristic discovery, notifications, and parsing of blink rate and battery data from NUS or text-based BLE messages.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity authentication context and provider, wrapping DFINITY's AuthClient to expose login, logout, and identity state to the React component tree.",
  "frontend/src/hooks/useLocalBlinkHistory.ts": "Maintains a persistent blink rate history (up to 1000 points) in localStorage, with helpers to add data points (including optional eye state) and clear history.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks for reading and writing blink rates, vibration events, blink summaries, and user profiles via the backend actor.",
  "frontend/src/hooks/useRecordBlinkRateWithQueue.ts": "Empty file with no implementation.",
  "frontend/src/hooks/useRollingBlinkRateAverage5Min.ts": "Tracks blink rate data points in memory and computes a rolling 5-minute average, pruning points older than 5 minutes on each update.",
  "frontend/src/hooks/useSessionBlinkRateHistory.ts": "Maintains an in-memory session history of up to 100 blink rate data points with add and clear helpers.",
  "frontend/src/index.css": "Defines Tailwind CSS base imports and a custom CSS variable-based design token system for light and dark themes, using a calm sleep-focused color palette.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app with React Query and Internet Identity providers wrapping the root App component.",
  "frontend/src/pages/Dashboard.tsx": "Main dashboard page that displays real-time blink rate data from a Bluetooth device, renders a blink rate chart with time range selection, and generates personalized sleep schedule recommendations based on a 5-minute rolling average.",
  "frontend/src/pages/DeviceConnection.tsx": "Page for managing Bluetooth device connections, allowing users to connect/disconnect their Eye-R smart glasses, configure service/characteristic UUIDs, and view live blink rate readings.",
  "frontend/src/pages/DeviceDataIngestion.tsx": "Documentation page describing the API for submitting ESP32-C3 telemetry data, including field definitions (deviceId, blinkRate, timestamp) and embedded API usage examples.",
  "frontend/src/pages/SmokeTest.tsx": "Diagnostic page that verifies frontend-to-backend canister connectivity by calling basic actor methods and displaying the status of Internet Identity authentication and the backend actor.",
  "frontend/src/types/bluetooth.d.ts": "TypeScript type declarations for the Web Bluetooth API, covering GATT server, service, characteristic, and descriptor interfaces along with request/filter option types.",
  "frontend/src/utils/bleNus.ts": "Utility module for Nordic UART Service (NUS) BLE communication, providing UUIDs, eye-state light level thresholds, and functions to parse raw sensor readings and NUS payloads into blink rate values.",
  "frontend/src/utils/bleUuid.ts": "Provides utility functions to normalize BLE UUIDs into Web Bluetooth API compatible formats (16-bit hex strings to numbers, 128-bit UUIDs as lowercase strings) and format them for display.",
  "frontend/src/utils/bleWriteQueue.ts": "Implements a localStorage-backed queue for BLE blink rate write operations, with functions to enqueue, retrieve, remove, and clear queued items.",
  "frontend/src/utils/localSleepSchedule.ts": "Generates local sleep and fatigue recommendations by analyzing the last 100 blink rate data points, using average BPM, variability, and current time of day to produce actionable advice.",
  "frontend/src/utils/personalizedSleepSchedule.ts": "Derives an alertness state (high-alertness, normal, or drowsy) from a 5-minute rolling average BPM and returns a corresponding personalized schedule plan with actionable items.",
  "frontend/src/utils/urlParams.ts": "Provides utilities for reading URL parameters from both query strings and hash-based routing, persisting them in sessionStorage, and cleaning sensitive parameters from the URL bar.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom theme tokens (colors via OKLCH variables, border radius, fonts, shadows, animations) and enabling the typography, container-queries, and animate plugins.",
  "project_state.json": "Tracks the project's current state and pending feature requests, specifically three fixes to the Motoko backend's 5-minute rolling average: Float precision, strict time-based pruning, and drift-free sum recalculation."
}