{
  "backend/main.mo": "Main Motoko actor for the sleep tracking backend, defining data types (BlinkRateMeasurement, VibrationEvent, BlinkSummary, etc.) and implementing CRUD operations with access control for user profiles, blink rates, vibration events, and blink summaries.",
  "feature_evidence.json": "Feature evidence report documenting a single implemented feature: updating the Bluetooth requestDevice() call to use acceptAllDevices and add the NUS service UUID to optionalServices in BluetoothContext.tsx and useEyeRBluetooth.ts.",
  "frontend-file-summaries.txt": "JSON-formatted text file containing one-sentence summaries of all frontend source files, serving as a reference index for the project's frontend components, hooks, and pages.",
  "frontend/index.css": "Global Tailwind CSS entry point defining OKLCH-based CSS custom properties for the design system's color tokens in both light and dark modes, including chart, sidebar, and semantic UI colors.",
  "frontend/index.html": "Minimal HTML shell for the Vite/React app, setting the page title to the sleep schedule app description and mounting the React root via main.tsx.",
  "frontend/src/App.tsx": "Root React component that sets up TanStack Router with four routes (Dashboard, DeviceConnection, DeviceDataIngestion, SmokeTest) wrapped in a BluetoothProvider context.",
  "frontend/src/components/actor/ActorBootstrap.tsx": "Deprecated wrapper component that previously initialized the ICP actor but now simply renders its children, as the app has moved to a local-first architecture.",
  "frontend/src/components/auth/AuthGate.tsx": "Landing page shown to unauthenticated users featuring a hero layout with app branding, feature highlights, a sleep-hero image, and an Internet Identity login button.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button that uses Internet Identity for authentication, clears the React Query cache on logout, and handles the already-authenticated edge case.",
  "frontend/src/components/charts/BlinkRateChart.tsx": "Canvas-based line chart component that visualizes blink rate history data points with a 3-second loading timeout, empty state with an alert icon, and axis labels showing blinks/min units.",
  "frontend/src/components/charts/BlinkSummaryHistory.tsx": "Empty file with no content, likely a placeholder for a future blink summary history chart component.",
  "frontend/src/components/charts/VibrationEventsChart.tsx": "Empty file with no content, likely a placeholder for the vibration events chart component referenced elsewhere in the project.",
  "frontend/src/components/device/BatteryIndicator.tsx": "A card component that displays battery percentage and charging status with dynamic icons, color-coded text, and a progress bar.",
  "frontend/src/components/device/DeviceSelector.tsx": "A card component with an input field for entering an ESP32-C3 device ID and a link to the device management page.",
  "frontend/src/components/docs/ApiExamples.tsx": "Displays tabbed code examples (JavaScript and cURL) for API operations like recording blink rates and vibration events, with copy-to-clipboard functionality.",
  "frontend/src/components/layout/AppHeader.tsx": "Sticky top navigation header with the app logo and links to Dashboard, Devices, API Docs, and Smoke Test pages.",
  "frontend/src/components/layout/AppLayout.tsx": "Root layout component that wraps pages with the AppHeader, a main content outlet, and a footer.",
  "frontend/src/components/profile/ProfileSetupDialog.tsx": "A deprecated, always-hidden dialog for profile name setup that is kept for compatibility but no longer used in local-first mode.",
  "frontend/src/components/recommendation/SleepScheduleCard.tsx": "A card that shows the current alertness state derived from a rolling blink average and allows generating a personalized sleep schedule recommendation.",
  "frontend/src/components/time/TimeRangePicker.tsx": "A card with a dropdown selector for choosing a time range (6h, 24h, 7d, 30d) and a utility function to convert the selection to nanosecond timestamps.",
  "frontend/src/contexts/BluetoothContext.tsx": "React context provider that manages BLE device connection lifecycle, parses incoming NUS characteristic data for blink rates and battery info, and tracks eye state using calibrated light-level thresholds.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an ICP backend actor using React Query, supporting both anonymous and authenticated (Internet Identity) usage, and invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useActorBootstrap.ts": "Deprecated stub hook that previously handled actor initialization; now a no-op as the app is fully local-first.",
  "frontend/src/hooks/useBleWriteQueue.ts": "Deprecated stub hook that previously queued BLE writes to the backend; now a no-op returning empty state.",
  "frontend/src/hooks/useBlinkSummaryFlush.ts": "Deprecated stub hook that previously flushed blink summaries to the backend; now a no-op since persistence is handled via localStorage.",
  "frontend/src/hooks/useCurrentUserProfile.ts": "Fetches the current authenticated user's profile from the backend actor using React Query, gating the query on actor availability.",
  "frontend/src/hooks/useDeviceId.ts": "Manages a device ID string in both React state and localStorage, providing get, set, and validity helpers.",
  "frontend/src/hooks/useEyeRBluetooth.ts": "Manages BLE connection lifecycle to an EyeR device, handling notifications for blink rate, battery, and charging status by parsing NUS UART data.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity authentication context and provider, wrapping DFINITY's AuthClient to expose login, logout, and identity state to the React component tree.",
  "frontend/src/hooks/useLocalBlinkHistory.ts": "Stores and retrieves a capped blink rate history (up to 1000 points) in localStorage, with add and clear operations.",
  "frontend/src/hooks/useQueries.ts": "Exposes React Query hooks for reading and writing blink rates, vibration events, blink summaries, and user profiles via the backend actor.",
  "frontend/src/hooks/useRecordBlinkRateWithQueue.ts": "Empty file with no implementation.",
  "frontend/src/hooks/useRollingBlinkRateAverage5Min.ts": "Maintains an in-memory rolling 5-minute window of blink rate data points and computes their average.",
  "frontend/src/hooks/useSessionBlinkRateHistory.ts": "Tracks an in-memory, session-scoped blink rate history capped at 100 points, with add and clear operations.",
  "frontend/src/index.css": "Defines Tailwind CSS base styles and a calm, sleep-focused CSS custom property color palette for both light and dark themes.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app wrapped with React Query and Internet Identity providers.",
  "frontend/src/pages/Dashboard.tsx": "Main dashboard page that displays real-time blink rate data from a Bluetooth device, renders a blink rate chart with time range selection, and generates personalized sleep schedule recommendations based on a 5-minute rolling average.",
  "frontend/src/pages/DeviceConnection.tsx": "Page for managing Bluetooth device connections, allowing users to connect/disconnect their Eye-R smart glasses, configure custom BLE service/characteristic UUIDs, and view live blink rate readings.",
  "frontend/src/pages/DeviceDataIngestion.tsx": "Documentation page describing the API for submitting ESP32-C3 smart glasses telemetry data, including field definitions and API usage examples for blink rate and vibration event ingestion.",
  "frontend/src/pages/SmokeTest.tsx": "Diagnostic page that verifies frontend-to-backend canister connectivity by testing Internet Identity authentication status and executing basic actor method calls.",
  "frontend/src/types/bluetooth.d.ts": "TypeScript type declarations for the Web Bluetooth API, defining interfaces for BLE GATT devices, servers, services, characteristics, descriptors, and scan filter options.",
  "frontend/src/utils/bleNus.ts": "Utility module for Nordic UART Service (NUS) BLE communication, providing UUIDs, eye-state light level thresholds, and functions to parse raw sensor readings and NUS notification payloads into blink rate values.",
  "frontend/src/utils/bleUuid.ts": "Provides UUID normalization utilities for the Web Bluetooth API, converting 16-bit hex strings to numbers and 128-bit UUID strings to lowercase, plus a display formatter.",
  "frontend/src/utils/bleWriteQueue.ts": "Implements a localStorage-backed queue for BLE blink rate write operations, with enqueue, dequeue, remove, and clear functions.",
  "frontend/src/utils/localSleepSchedule.ts": "Generates local sleep and rest recommendations by analyzing the last 100 blink rate data points, categorizing alertness and adding time-of-day advice.",
  "frontend/src/utils/personalizedSleepSchedule.ts": "Derives an alertness state (high-alertness, normal, drowsy) from a rolling average BPM and returns a corresponding personalized schedule plan with actionable items.",
  "frontend/src/utils/urlParams.ts": "Provides utilities for reading URL query parameters from both regular and hash-based routes, persisting them in sessionStorage, and cleaning sensitive params from the URL bar.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with dark mode, custom OKLCH color tokens, border radius, font family, box shadows, and accordion keyframe animations, using typography, container-queries, and animate plugins.",
  "project_state.json": "Tracks project metadata and state for an eye-tracking BLE web app on the Internet Computer, recording existing features, known issues, and the current fix request to enable acceptAllDevices and add the Nordic UART Service UUID to optionalServices."
}