{
  "backend/main.mo": "Motoko actor managing blink rates, vibration events, blink summaries, and user profiles with access control and ownership filtering.",
  "feature_evidence.json": "Lists feature evidence records linking planned feature changes to affected frontend files and components.",
  "frontend-file-summaries.txt": "Contains predefined summaries of multiple frontend files for reference in build planning.",
  "frontend/index.css": "Defines Tailwind base styles and OKLCH color variables for light and dark themes.",
  "frontend/index.html": "HTML entry point mounting the app and loading the main React bundle.",
  "frontend/src/App.tsx": "Sets up router routes and wraps the app in the BluetoothProvider and AppLayout.",
  "frontend/src/components/actor/ActorBootstrap.tsx": "Deprecated wrapper component that simply renders its children without actor initialization.",
  "frontend/src/components/auth/AuthGate.tsx": "Login landing screen using Internet Identity with branding, CTA, and hero section.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button integrating Internet Identity with query cache clearing on logout.",
  "frontend/src/components/charts/BlinkRateChart.tsx": "Canvas‑based blink‑rate history chart with loading and empty states.",
  "frontend/src/components/charts/BlinkSummaryHistory.tsx": "Empty placeholder file for blink summary history chart.",
  "frontend/src/components/charts/VibrationEventsChart.tsx": "Empty file intended for vibration events chart implementation.",
  "frontend/src/components/device/DeviceSelector.tsx": "Device selection card that lets users input a device ID and navigate to device management.",
  "frontend/src/components/docs/ApiExamples.tsx": "Displays API usage examples with JS and cURL tabs and supports copying code snippets.",
  "frontend/src/components/layout/AppHeader.tsx": "Top navigation header with links to dashboard, devices, API docs, and smoke test.",
  "frontend/src/components/layout/AppLayout.tsx": "App layout wrapper with header, main content outlet, and footer.",
  "frontend/src/components/profile/ProfileSetupDialog.tsx": "Deprecated dialog for entering a user name; remains but is never shown.",
  "frontend/src/components/recommendation/SleepScheduleCard.tsx": "Card component showing live alertness state and enabling generation of personalized sleep schedules.",
  "frontend/src/components/time/TimeRangePicker.tsx": "Card with a dropdown for selecting predefined data time ranges and computing timestamps.",
  "frontend/src/contexts/BluetoothContext.tsx": "Bluetooth provider managing BLE connections, NUS notifications, parsing sensor data, and blink detection.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and manages a backend actor instance and invalidates dependent queries on change.",
  "frontend/src/hooks/useActorBootstrap.ts": "Deprecated hook that previously initialized the actor but now performs no operations.",
  "frontend/src/hooks/useBleWriteQueue.ts": "Deprecated hook providing a no-op BLE write queue interface.",
  "frontend/src/hooks/useBlinkSummaryFlush.ts": "Deprecated hook stub for blink summary flushing with no backend actions.",
  "frontend/src/hooks/useCurrentUserProfile.ts": "Hook to fetch the current user profile via the actor when available.",
  "frontend/src/hooks/useDeviceId.ts": "Manages a device ID with localStorage persistence and validity checks.",
  "frontend/src/hooks/useEyeRBluetooth.ts": "Provides BLE connection management, notification handling, and blink‑rate parsing for EyeR devices.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity auth context, managing login, stored identities, and status flags.",
  "frontend/src/hooks/useLocalBlinkHistory.ts": "Tracks and persists blink‑rate history in localStorage with pruning and save timestamps.",
  "frontend/src/hooks/useQueries.ts": "Wraps backend actor calls with react‑query hooks for fetching and mutating blink data and user profiles.",
  "frontend/src/hooks/useRecordBlinkRateWithQueue.ts": "Empty file with no implementation.",
  "frontend/src/hooks/useRollingBlinkRateAverage5Min.ts": "Maintains a 5‑minute rolling window of blink data and computes its average.",
  "frontend/src/hooks/useSessionBlinkRateHistory.ts": "Stores a short, in‑memory session blink‑rate history capped at 100 points.",
  "frontend/src/index.css": "Defines Tailwind layers and custom CSS variables for light and dark UI themes.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/Dashboard.tsx": "Main dashboard showing live blink data, charts, rolling averages, history, and schedule generation logic.",
  "frontend/src/pages/DeviceConnection.tsx": "UI for connecting to a Bluetooth device, handling custom UUIDs, auto-discovery, and tracking live blink rate updates.",
  "frontend/src/pages/DeviceDataIngestion.tsx": "Documentation page describing the telemetry ingestion API and required data fields for ESP32-C3 device uploads.",
  "frontend/src/pages/SmokeTest.tsx": "Runs a frontend-to-backend connectivity test using the actor and Internet Identity, reporting pass/fail status.",
  "frontend/src/types/bluetooth.d.ts": "TypeScript declarations for Web Bluetooth GATT interfaces, services, characteristics, and request options.",
  "frontend/src/utils/bleNus.ts": "Utility functions for parsing Nordic UART Service notifications and legacy heart-rate style blink rate data.",
  "frontend/src/utils/bleUuid.ts": "Normalizes and formats BLE UUIDs for Web Bluetooth compatibility and display.",
  "frontend/src/utils/bleWriteQueue.ts": "LocalStorage-backed queue for storing unsent blink rate data with helpers to add, remove, and clear entries.",
  "frontend/src/utils/localSleepSchedule.ts": "Analyzes the last 100 blink-rate data points to compute average BPM and generate sleep and alertness recommendations.",
  "frontend/src/utils/personalizedSleepSchedule.ts": "Maps rolling average BPM to an alertness state and returns corresponding work/rest schedule plans.",
  "frontend/src/utils/urlParams.ts": "Provides utilities for reading, persisting, and clearing URL and sessionStorage parameters, including hash-based routing support.",
  "frontend/tailwind.config.js": "Configures TailwindCSS theme, colors, typography, animations, and plugins for the frontend.",
  "project_state.json": "Stores project metadata, issues, and feature requests related to recalibrating eye open/closed detection thresholds."
}