{
  "backend/main.mo": "Motoko canister defining event types, user profiles, access control, and storage plus filtering logic for blink rate and vibration telemetry.",
  "feature_evidence.json": "Feature evidence report describing a Web Bluetooth update to target the Heart Rate service and listing affected files and metadata.",
  "frontend-file-summaries.txt": "Catalog of frontend file summaries providing short explanations of each component, hook, and page.",
  "frontend/index.css": "Tailwind base styles and OKLCH color variables for light and dark themes.",
  "frontend/index.html": "HTML entry file mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Root React component configuring authentication flow and TanStack Router routes for main pages.",
  "frontend/src/components/auth/AuthGate.tsx": "Unauthenticated landing page with login prompt, hero section, and feature highlights.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button handling Internet Identity authentication and React Query cache clearing.",
  "frontend/src/components/charts/BlinkRateChart.tsx": "Recharts line chart component visualizing blink rate history with loading and empty states.",
  "frontend/src/components/charts/VibrationEventsChart.tsx": "Displays hourly grouped vibration events in a bar chart with loading and empty states.",
  "frontend/src/components/device/DeviceSelector.tsx": "Provides an input form to select and validate a device ID with a link to manage devices.",
  "frontend/src/components/docs/ApiExamples.tsx": "Shows code examples for API usage with tabs and clipboard copy functionality.",
  "frontend/src/components/layout/AppHeader.tsx": "Renders the top navigation bar with user profile info and route-aware navigation buttons.",
  "frontend/src/components/layout/AppLayout.tsx": "Wraps the app with header, routed content, and a footer.",
  "frontend/src/components/profile/ProfileSetupDialog.tsx": "Modal dialog prompting the user to enter and save their name during initial setup.",
  "frontend/src/components/recommendation/SleepScheduleCard.tsx": "Displays AI-generated sleep schedule recommendations or prompts to generate them based on available data.",
  "frontend/src/components/time/TimeRangePicker.tsx": "Provides UI for selecting a time range and includes helpers to compute timestamp ranges.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor instance with identity-aware initialization and query invalidation.",
  "frontend/src/hooks/useCurrentUserProfile.ts": "Fetches the current user's profile using the actor, handling loading and availability state.",
  "frontend/src/hooks/useDeviceId.ts": "Stores and validates a persisted device ID using localStorage.",
  "frontend/src/hooks/useEyeRBluetooth.ts": "React hook managing Web Bluetooth connections to a heart-rate-like service and emitting parsed blink-rate readings.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity auth context with login, logout, and identity persistence via Dfinity AuthClient.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks wrapping backend actor calls for blink rates, vibration events, sleep recommendations, and user profile mutations.",
  "frontend/src/index.css": "Tailwind base configuration defining light/dark theme CSS variables and global styles.",
  "frontend/src/main.tsx": "Application entry point setting up React Query and Internet Identity providers before rendering the app.",
  "frontend/src/pages/Dashboard.tsx": "Dashboard page showing blink rate and vibration charts, time range selection, and sleep recommendation generation.",
  "frontend/src/pages/DeviceConnection.tsx": "Page for managing saved devices, connecting via Bluetooth, receiving blink-rate readings, and storing them via backend.",
  "frontend/src/pages/DeviceDataIngestion.tsx": "Documentation page describing required telemetry fields and ESP32-C3 data ingestion behavior using UI cards and alerts.",
  "frontend/src/types/bluetooth.d.ts": "TypeScript declarations for Web Bluetooth APIs including devices, GATT servers, services, and characteristics.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading URL parameters, storing them in sessionStorage, and managing persisted routing state.",
  "frontend/tailwind.config.js": "Tailwind configuration extending colors, radius, fonts, animations, and enabling typography, container queries, and animation plugins.",
  "project_state.json": "Project metadata containing the app summary, architectural notes, known issues, and feature definitions for development tracking."
}