{
  "backend/main.mo": "Motoko canister defining smart‑glasses event types, access‑controlled profile APIs, and storage for blink rates, vibrations, and blink summaries.",
  "feature_evidence.json": "Feature evidence report linking a BLE blink-detection update to affected frontend files and components.",
  "frontend-file-summaries.txt": "Prewritten summaries of various frontend files describing their roles in routing, BLE handling, charts, UI, and hooks.",
  "frontend/index.css": "Tailwind base stylesheet defining extensive OKLCH color tokens and dark-mode variables for the app theme.",
  "frontend/index.html": "Base HTML page mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Main React app configuring routes and wrapping the UI in BluetoothProvider and AppLayout.",
  "frontend/src/components/actor/ActorBootstrap.tsx": "Deprecated wrapper component that now simply renders children without actor initialization.",
  "frontend/src/components/auth/AuthGate.tsx": "Authentication landing screen with Internet Identity login and marketing layout.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button handling Internet Identity auth state and React Query cache clearing.",
  "frontend/src/components/charts/BlinkRateChart.tsx": "Canvas-based line chart rendering blink-rate history with loading and empty states.",
  "frontend/src/components/charts/BlinkSummaryHistory.tsx": "Empty placeholder file with no implementation.",
  "frontend/src/components/charts/VibrationEventsChart.tsx": "File present but contains no implementation (truncated content).",
  "frontend/src/components/device/DeviceSelector.tsx": "Renders a card with an input for selecting a device ID and a link to manage devices.",
  "frontend/src/components/docs/ApiExamples.tsx": "Displays example API usage with JavaScript and cURL tabs and copy-to-clipboard functionality.",
  "frontend/src/components/layout/AppHeader.tsx": "Provides the top navigation header with links to main app sections.",
  "frontend/src/components/layout/AppLayout.tsx": "Wraps the app with header, main content outlet, and footer.",
  "frontend/src/components/profile/ProfileSetupDialog.tsx": "Deprecated dialog for entering a user name; now always closed and unused.",
  "frontend/src/components/recommendation/SleepScheduleCard.tsx": "Shows live alertness state info and allows generating a personalized sleep schedule.",
  "frontend/src/components/time/TimeRangePicker.tsx": "Card-based selector for choosing a time range and computing start/end timestamps.",
  "frontend/src/contexts/BluetoothContext.tsx": "Implements Bluetooth connection, notifications, and blink/eye-state processing logic.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor instance with identity-aware refetching.",
  "frontend/src/hooks/useActorBootstrap.ts": "Deprecated hook that formerly handled actor initialization; now a no-op.",
  "frontend/src/hooks/useBleWriteQueue.ts": "Deprecated hook returning a no-op BLE write queue interface.",
  "frontend/src/hooks/useBlinkSummaryFlush.ts": "Deprecated hook that once flushed blink data to backend; now returns static values.",
  "frontend/src/hooks/useCurrentUserProfile.ts": "Queries the backend for the current user's profile using the actor instance.",
  "frontend/src/hooks/useDeviceId.ts": "Manages a device ID in React state and localStorage with validation.",
  "frontend/src/hooks/useEyeRBluetooth.ts": "Handles Web Bluetooth connection, notifications, and blink‑rate parsing for EyeR devices.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context using Dfinity AuthClient with login, logout, and identity loading.",
  "frontend/src/hooks/useLocalBlinkHistory.ts": "Stores blink‑rate history in localStorage with add, clear, and capped history size.",
  "frontend/src/hooks/useQueries.ts": "React Query wrappers for fetching and mutating blink rates, vibration events, summaries, and user profiles.",
  "frontend/src/hooks/useRecordBlinkRateWithQueue.ts": "Empty file.",
  "frontend/src/hooks/useRollingBlinkRateAverage5Min.ts": "Computes a rolling 5‑minute blink‑rate average with pruning and add/clear helpers.",
  "frontend/src/hooks/useSessionBlinkRateHistory.ts": "Tracks in‑memory blink‑rate history for the current session capped at 100 points.",
  "frontend/src/index.css": "Tailwind setup with light/dark theme CSS variables for UI colors and typography.",
  "frontend/src/main.tsx": "Initializes React app with QueryClient and InternetIdentityProvider.",
  "frontend/src/pages/Dashboard.tsx": "Dashboard page showing live blink data, rolling averages, historical storage, and sleep‑schedule generation.",
  "frontend/src/pages/DeviceConnection.tsx": "React page for connecting to a Bluetooth device, managing UUID settings, tracking blink-rate notifications, and displaying connection status.",
  "frontend/src/pages/DeviceDataIngestion.tsx": "Documentation page describing how devices submit telemetry data, including required fields and API examples.",
  "frontend/src/pages/SmokeTest.tsx": "UI page that tests backend connectivity by calling basic actor methods and reporting authentication and actor status.",
  "frontend/src/types/bluetooth.d.ts": "TypeScript declarations for Web Bluetooth GATT interfaces, services, characteristics, and request options.",
  "frontend/src/utils/bleNus.ts": "Utilities for parsing Nordic UART Service messages, extracting blink rates, eye-state tokens, and legacy heart-rate–based readings.",
  "frontend/src/utils/bleUuid.ts": "Helpers for normalizing and formatting UUIDs for Web Bluetooth use.",
  "frontend/src/utils/bleWriteQueue.ts": "LocalStorage-backed queue for storing blink-rate data points before transmission.",
  "frontend/src/utils/localSleepSchedule.ts": "Analyzes the last 100 blink-rate readings to compute average BPM and generate sleep and alertness recommendations.",
  "frontend/src/utils/personalizedSleepSchedule.ts": "Maps rolling average BPM to an alertness state and returns a corresponding task or rest schedule.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading, persisting, and clearing URL and sessionStorage parameters, including hash-based routing support.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, fonts, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Describes the project state, including versions, features, and a request to treat BLE 'close' notifications as blink events."
}