{
  "backend/main.mo": "Motoko canister managing blink rates, vibration events, user profiles, and access control with data filtering and event summaries.",
  "feature_evidence.json": "Feature evidence report describing a clean rebuild/deploy feature with related files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries of various frontend files including hooks, components, pages, and styles.",
  "frontend/index.css": "Global Tailwind styles defining OKLCH color tokens and light/dark theme variables.",
  "frontend/index.html": "Base HTML template mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Main React router setup with routes for dashboard, device connection, ingestion, and smoke test inside a BluetoothProvider.",
  "frontend/src/components/actor/ActorBootstrap.tsx": "Deprecated wrapper component that no longer initializes actors and simply renders children.",
  "frontend/src/components/auth/AuthGate.tsx": "Login landing page using Internet Identity with marketing content and a CTA to authenticate.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button managing Internet Identity state and clearing React Query cache on logout.",
  "frontend/src/components/charts/BlinkRateChart.tsx": "Canvas-based line chart rendering blink rate history with loading/empty states and simple scaling logic.",
  "frontend/src/components/charts/BlinkSummaryHistory.tsx": "Empty placeholder file for a blink summary history chart.",
  "frontend/src/components/charts/VibrationEventsChart.tsx": "Truncated file; expected to display vibration event data but contains no content here.",
  "frontend/src/components/device/DeviceSelector.tsx": "Renders a card for entering and validating a device ID with a link to manage devices.",
  "frontend/src/components/docs/ApiExamples.tsx": "Displays API usage examples with tabs and copy-to-clipboard buttons for JS and cURL snippets.",
  "frontend/src/components/layout/AppHeader.tsx": "Provides the app’s top navigation bar with links to main sections.",
  "frontend/src/components/layout/AppLayout.tsx": "Defines the overall page layout with header, content outlet, and footer.",
  "frontend/src/components/profile/ProfileSetupDialog.tsx": "Deprecated dialog for entering a user name; remains as a non-rendered compatibility component.",
  "frontend/src/components/recommendation/SleepScheduleCard.tsx": "Shows current alertness state and allows generating a personalized sleep schedule based on blink data.",
  "frontend/src/components/time/TimeRangePicker.tsx": "Card UI for selecting a time range and utility to compute start/end timestamps.",
  "frontend/src/contexts/BluetoothContext.tsx": "Manages BLE connection lifecycle, notifications, and blink detection from sensor data.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an actor for backend calls, refreshing when identity changes.",
  "frontend/src/hooks/useActorBootstrap.ts": "Deprecated hook that formerly initialized actors; now a no-op.",
  "frontend/src/hooks/useBleWriteQueue.ts": "Deprecated hook returning a no-op BLE write queue.",
  "frontend/src/hooks/useBlinkSummaryFlush.ts": "Deprecated hook for backend blink summary flushing; now returns static values.",
  "frontend/src/hooks/useCurrentUserProfile.ts": "Fetches the caller’s user profile via the actor once initialized.",
  "frontend/src/hooks/useDeviceId.ts": "Manages a device ID with localStorage persistence and exposes validity state.",
  "frontend/src/hooks/useEyeRBluetooth.ts": "Handles Web Bluetooth connections, notifications, and blink‑rate parsing for EyeR devices.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity auth context using Dfinity AuthClient with login, logout, and state management.",
  "frontend/src/hooks/useLocalBlinkHistory.ts": "Maintains blink‑rate history in localStorage with capped size and helper actions.",
  "frontend/src/hooks/useQueries.ts": "Wraps backend actor queries and mutations for blink data, vibration events, and user profiles using React Query.",
  "frontend/src/hooks/useRecordBlinkRateWithQueue.ts": "Empty file with no implementation.",
  "frontend/src/hooks/useRollingBlinkRateAverage5Min.ts": "Tracks blink rates and computes a rolling 5‑minute average with pruning and state helpers.",
  "frontend/src/hooks/useSessionBlinkRateHistory.ts": "Stores an in‑memory session‑only blink‑rate history limited to recent entries.",
  "frontend/src/index.css": "Defines Tailwind base styles and a light/dark UI color palette with CSS variables.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentityProvider.",
  "frontend/src/pages/Dashboard.tsx": "Dashboard UI showing live blink data, rolling averages, device selection, history, and personalized sleep schedule generation.",
  "frontend/src/pages/DeviceConnection.tsx": "UI for managing Bluetooth connection to ESP32-C3, handling connect/disconnect, blink rate updates, and status display.",
  "frontend/src/pages/DeviceDataIngestion.tsx": "Documentation page describing how devices submit telemetry data, including required fields and API behavior.",
  "frontend/src/pages/SmokeTest.tsx": "Frontend page that runs basic backend connectivity tests using Internet Identity and an actor instance.",
  "frontend/src/types/bluetooth.d.ts": "TypeScript declarations for Web Bluetooth GATT APIs, defining devices, services, characteristics, and related types.",
  "frontend/src/utils/bleNus.ts": "Utilities for parsing blink rate data from Nordic UART Service and legacy heart-rate–style BLE notifications.",
  "frontend/src/utils/bleUuid.ts": "Helpers for normalizing and formatting BLE UUIDs into Web Bluetooth–compatible forms.",
  "frontend/src/utils/bleWriteQueue.ts": "LocalStorage-backed queue for storing unsent blink rate records with enqueue, fetch, remove, and clear operations.",
  "frontend/src/utils/localSleepSchedule.ts": "Analyzes recent blink‑rate data to compute average BPM and generates sleep or alertness recommendations based on thresholds and variability.",
  "frontend/src/utils/personalizedSleepSchedule.ts": "Maps rolling average BPM to an alertness state and returns predefined work/rest schedules tailored to that state.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading URL parameters, persisting them in sessionStorage, and cleaning parameters from hash‑based routes.",
  "frontend/tailwind.config.js": "Configures Tailwind CSS theme extensions, colors, fonts, animations, and plugins including typography and container queries.",
  "project_state.json": "Captures project state and issues, noting a stuck deployment and requirements for forced rebuild and detailed error reporting."
}