{
  "backend/main.mo": "Motoko actor defining smart‑glasses data types, authorization checks, user profiles, blink/vibration storage, and filtering helpers.",
  "feature_evidence.json": "Feature evidence report mapping feature IDs to affected files, components, and test IDs.",
  "frontend-file-summaries.txt": "Plaintext mapping of frontend file paths to brief descriptive summaries.",
  "frontend/index.css": "Tailwind base styles defining OKLCH color tokens, theming variables, and light/dark mode palettes.",
  "frontend/index.html": "Root HTML document mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "React app entry with TanStack Router routes and BluetoothProvider wrapping the layout.",
  "frontend/src/components/actor/ActorBootstrap.tsx": "Deprecated wrapper that no longer initializes backend actors and simply returns children.",
  "frontend/src/components/auth/AuthGate.tsx": "Login landing screen using Internet Identity with marketing copy and a login button.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button using Internet Identity with query cache clearing on logout.",
  "frontend/src/components/charts/BlinkRateChart.tsx": "Canvas-based chart component rendering blink-rate history with loading and empty states.",
  "frontend/src/components/charts/BlinkSummaryHistory.tsx": "Empty file placeholder for a future blink summary history chart.",
  "frontend/src/components/charts/VibrationEventsChart.tsx": "Empty file placeholder for a vibration events chart.",
  "frontend/src/components/device/DeviceSelector.tsx": "Form component for entering and validating a device ID and linking to device management.",
  "frontend/src/components/docs/ApiExamples.tsx": "Displays API usage examples with tabs and copy-to-clipboard functionality.",
  "frontend/src/components/layout/AppHeader.tsx": "Top navigation header with links to dashboard, devices, and API docs.",
  "frontend/src/components/layout/AppLayout.tsx": "Page layout wrapper providing header, main content outlet, and footer.",
  "frontend/src/components/profile/ProfileSetupDialog.tsx": "Deprecated dialog for entering a user name; currently always closed.",
  "frontend/src/components/recommendation/SleepScheduleCard.tsx": "Displays current alertness state, recent readings, and a button to generate a personalized sleep schedule.",
  "frontend/src/components/time/TimeRangePicker.tsx": "Card containing a time-range selector and helper for converting ranges to timestamps.",
  "frontend/src/contexts/BluetoothContext.tsx": "Provides Bluetooth connection management, notifications, and blink-rate parsing for Web Bluetooth.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor using the current Internet Identity, reinitializing and invalidating queries when identity changes.",
  "frontend/src/hooks/useActorBootstrap.ts": "Deprecated hook returning static initialization state with no backend interaction.",
  "frontend/src/hooks/useBleWriteQueue.ts": "Deprecated BLE write queue hook that always reports an empty, idle queue.",
  "frontend/src/hooks/useBlinkSummaryFlush.ts": "Deprecated hook that no longer flushes summaries and only tracks a placeholder timestamp.",
  "frontend/src/hooks/useCurrentUserProfile.ts": "Fetches the caller's user profile from the backend actor once the actor is ready.",
  "frontend/src/hooks/useDeviceId.ts": "Manages a persistent device ID in localStorage with validation.",
  "frontend/src/hooks/useEyeRBluetooth.ts": "Provides Web Bluetooth connection handling, notifications, and blink‑rate parsing for EyeR devices.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication state, login, logout, and identity persistence using AuthClient.",
  "frontend/src/hooks/useLocalBlinkHistory.ts": "Stores blink‑rate history locally with add, clear, and auto‑persist behavior.",
  "frontend/src/hooks/useQueries.ts": "Defines backend React Query hooks for fetching and mutating blink data, vibration events, and user profiles.",
  "frontend/src/hooks/useRecordBlinkRateWithQueue.ts": "Empty placeholder file with no implementation.",
  "frontend/src/hooks/useRollingBlinkRateAverage5Min.ts": "Maintains recent blink‑rate points and computes a 5‑minute rolling average.",
  "frontend/src/hooks/useSessionBlinkRateHistory.ts": "Tracks in‑memory session blink‑rate history with a capped list.",
  "frontend/src/index.css": "Tailwind setup defining light/dark theme variables and global styles.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentityProvider.",
  "frontend/src/pages/Dashboard.tsx": "Renders the main dashboard showing live blink-rate data, rolling averages, historical trends, and generates a personalized sleep schedule based on alertness state.",
  "frontend/src/pages/DeviceConnection.tsx": "Provides UI and logic for configuring device IDs, managing Bluetooth connections, and saving incoming blink-rate data locally.",
  "frontend/src/pages/DeviceDataIngestion.tsx": "Displays documentation for the device telemetry ingestion API, including required fields and data handling details.",
  "frontend/src/types/bluetooth.d.ts": "Defines TypeScript types for Web Bluetooth GATT devices, services, characteristics, descriptors, and related request options.",
  "frontend/src/utils/bleNus.ts": "Implements parsing utilities for extracting blink-rate values from Nordic UART Service and heart-rate characteristic BLE payloads.",
  "frontend/src/utils/bleUuid.ts": "Provides helper functions to normalize and format BLE UUIDs for Web Bluetooth compatibility.",
  "frontend/src/utils/bleWriteQueue.ts": "Implements a localStorage-backed queue for storing blink-rate write operations with enqueue, read, remove, and clear functions.",
  "frontend/src/utils/localSleepSchedule.ts": "Generates sleep recommendations based on the last 100 blink-rate data points, computing average BPM and adding guidance based on thresholds and variability.",
  "frontend/src/utils/personalizedSleepSchedule.ts": "Determines alertness state from rolling BPM and returns a predefined schedule plan for high-alertness, normal, or drowsy states.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading URL parameters, persisting them in sessionStorage, and managing stored values including hash-based routing.",
  "frontend/tailwind.config.js": "Configures Tailwind CSS with custom colors, typography, animations, and plugins for the frontend UI.",
  "project_state.json": "Describes the project's local-first architecture plan, known issues, and feature requirements related to removing backend dependencies and using localStorage."
}