{
  "kind": "build_request",
  "title": "Force clean rebuild and redeploy Eye-R to live canister with exact error reporting",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Force a clean rebuild of the Eye-R project (frontend + backend) and redeploy the resulting build artifacts to the live canister (not draft).",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "The live deployment is stuck. Please force a rebuild of the 'Eye-R' project and push it to the live canister again."
        ]
      },
      "acceptanceCriteria": [
        "A clean build is executed (no cached artifacts relied upon) for both the Motoko backend and React frontend.",
        "The live canister is updated with the newly built WASM/assets for project 'Eye-R'.",
        "Post-deploy, the live URL loads the latest frontend and backend canister responds to calls (basic smoke test)."
      ]
    },
    {
      "id": "REQ-2",
      "text": "If the rebuild or redeploy fails, capture and present the exact build/deploy error output (verbatim) including the failing command, exit code, and the full compiler/toolchain error text so it can be used to diagnose and fix the issue.",
      "target": "unknown",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "If there is a build error, please tell me exactly what it is so we can fix it."
        ]
      },
      "acceptanceCriteria": [
        "On failure, the report includes: (1) the exact step that failed, (2) the exact command executed, (3) the full stdout/stderr output, and (4) the exit code.",
        "No error text is paraphrased; the original error output is preserved verbatim."
      ]
    }
  ],
  "constraints": [
    "Use English for any user-facing text.",
    "Backend must remain a single Motoko actor in backend/main.mo; only add backend/migration.mo if a state upgrade is required by code changes.",
    "Do not edit files under frontend/src/components/ui or any paths listed in frontend.immutablePaths."
  ],
  "nonGoals": [
    "Implementing new product features unrelated to unblocking deployment.",
    "Changing application behavior (blink detection, UI labels, etc.) unless required to fix a build failure discovered during rebuild."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}