{
  "kind": "build_request",
  "title": "Treat BLE 'close' detection as a blink event",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Update BLE parsing and blink detection so that when an incoming BLE notification is decoded as text containing the eye-state token \"close\" (case-insensitive), the app records a blink event (i.e., increments the rolling blink counter used to compute the \"blinks in last 60 seconds\" value), even if no numeric light-level value is present.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "once detected \"close,\" set it as blink"
        ]
      },
      "acceptanceCriteria": [
        "When the BLE notification payload decodes to text that includes \"close\" (any casing), a blink is added to the 60-second rolling window and the Live Blink Rate number increases accordingly.",
        "If multiple consecutive notifications contain \"close\" with no intervening \"open\", the implementation prevents runaway double-counting by applying a reasonable de-duplication/debounce rule (e.g., count only on first \"close\" until an \"open\" is seen, or impose a minimum time gap).",
        "Existing numeric light-level based open→closed transition detection continues to function as it does today for numeric payloads.",
        "No changes are required to backend storage/APIs for this behavior; the change is limited to the frontend BLE parsing/detection flow (e.g., in `frontend/src/contexts/BluetoothContext.tsx`, and related parsing utilities if needed)."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under `frontend/src/components/ui` (read-only).",
    "Do not edit immutable hook/entry paths: `frontend/src/hooks/useInternetIdentity.ts`, `frontend/src/hooks/useInternetIdentity.tsx`, `frontend/src/hooks/useActor.ts`, `frontend/src/main.tsx`.",
    "Keep all backend logic within the existing single Motoko actor (`backend/main.mo`) and do not introduce additional backend services."
  ],
  "nonGoals": [
    "Adding new backend endpoints or persisting individual blink events in the backend specifically for \"close\" tokens.",
    "Implementing real-time streaming or WebSocket-based updates."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}