{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Eye-R frontend deployment diagnostics (clean rebuild, smoke test, verbatim error reporting)",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Add a frontend-accessible smoke test view and a clean rebuild/redeploy helper script to support verifying a fresh live deployment.",
      "acceptanceCriteria": [
        "A clean build is executed (no cached artifacts relied upon) for both the Motoko backend and React frontend.",
        "The live canister is updated with the newly built WASM/assets for project 'Eye-R'.",
        "Post-deploy, the live URL loads the latest frontend and backend canister responds to calls (basic smoke test)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/SmokeTest.tsx",
          "operation": "create",
          "description": "Create a Smoke Test page that performs a basic read call via the existing actor (e.g., role/profile queries) and renders clear PASS/FAIL status plus any thrown error text verbatim to help verify post-deploy connectivity."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Register a new TanStack Router route for the Smoke Test page (e.g., /smoke-test) so it is reachable for post-deploy verification."
        },
        {
          "path": "frontend/src/components/layout/AppHeader.tsx",
          "operation": "modify",
          "description": "Wire a navigation link to the Smoke Test route so the check is easily discoverable after deployment."
        },
        {
          "path": "frontend/scripts/clean-rebuild-redeploy.mjs",
          "operation": "create",
          "description": "Add a Node script (invoked manually) that runs a clean rebuild and redeploy workflow by orchestrating the necessary shell commands (including cache removal for frontend build artifacts) and then runs the frontend smoke test instructions for the live URL. Ensure the script is safe-by-default and does not change app runtime behavior."
        },
        {
          "path": "frontend/DEPLOYMENT.md",
          "operation": "create",
          "description": "Document the clean rebuild + live redeploy procedure, including how to run the clean rebuild/redeploy script and how to use the Smoke Test route on the live URL for a basic verification."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Provide a verbatim build/redeploy failure report generator that captures the failing command, exit code, and full stdout/stderr output.",
      "acceptanceCriteria": [
        "On failure, the report includes: (1) the exact step that failed, (2) the exact command executed, (3) the full stdout/stderr output, and (4) the exit code.",
        "No error text is paraphrased; the original error output is preserved verbatim."
      ],
      "file_operations": [
        {
          "path": "frontend/scripts/run-step-with-verbatim-log.mjs",
          "operation": "create",
          "description": "Create a small Node helper that executes a single shell command, captures full stdout/stderr verbatim, records the exit code, and writes a structured, copy-pastable failure report to the console and an output file."
        },
        {
          "path": "frontend/scripts/clean-rebuild-redeploy.mjs",
          "operation": "modify",
          "description": "Integrate the verbatim logging helper so each rebuild/redeploy step is executed through it and failures emit an exact report including step name, exact command, full stdout/stderr, and exit code (no paraphrasing)."
        },
        {
          "path": "frontend/DEPLOYMENT.md",
          "operation": "modify",
          "description": "Add a troubleshooting section describing where to find the verbatim failure report output file, and how to share it for diagnosis without modification."
        }
      ]
    }
  ]
}