{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Calibrated eye open/closed thresholds for blink detection",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Replace the legacy BLINK_THRESHOLD-based blink detection with calibrated open/closed light-level classification and a transition-based blink counter.",
      "acceptanceCriteria": [
        "Blink detection no longer relies on `rawSensorValue < 30`.",
        "The code defines explicit thresholds that separate the two provided ranges (open 250–290 vs closed 160–180) and uses them to classify eye state.",
        "A blink is counted when the sensor reading transitions from the open state into the closed state (with a state guard to prevent multiple counts during a single closure).",
        "When the sensor value stays within the open range (250–290), no blinks are counted.",
        "When the sensor value stays within the closed range (160–180), at most one blink is counted until the value returns to the open state."
      ],
      "file_operations": [
        {
          "path": "frontend/src/contexts/BluetoothContext.tsx",
          "operation": "modify",
          "description": "Remove the `BLINK_THRESHOLD = 30` blink classification logic and introduce calibrated constants for eye-open (250–290) and eye-closed (160–180). Implement an explicit eye-state classifier (e.g., open/closed/unknown) and update blink counting to increment only on an open→closed transition, with a guard so sustained closed readings count at most one blink until an open reading is observed again. Keep the existing rolling 60s window pruning and onBlinkRateChange emission behavior intact."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Update Device Connection debug/help text to describe the calibrated eye open/closed light-level thresholds instead of the old “below 30” rule.",
      "acceptanceCriteria": [
        "The \"Raw Sensor Reading (Debug)\" description and the Help section note no longer mention \"drops below 30\".",
        "The text describes the calibrated eye open and eye closed light-level thresholds in English.",
        "No other unrelated UI text is changed."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/DeviceConnection.tsx",
          "operation": "modify",
          "description": "Update the \"Raw Sensor Reading (Debug)\" CardDescription and the Help section note to remove references to \"values below 30\" and instead explain the calibrated ranges (eye open: 250–290, eye closed: 160–180) and that a blink is counted on an open→closed transition (one count per closure until the value returns to the open range). Do not change unrelated UI copy or any files under `frontend/src/components/ui`."
        }
      ]
    }
  ]
}