{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Treat BLE 'close' token as a blink event (frontend BLE parsing)",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Extend BLE notification parsing so a case-insensitive \"close\" eye-state token counts as a blink (with de-duplication) even when no numeric light-level is present, while preserving existing numeric transition detection.",
      "acceptanceCriteria": [
        "When the BLE notification payload decodes to text that includes \"close\" (any casing), a blink is added to the 60-second rolling window and the Live Blink Rate number increases accordingly.",
        "If multiple consecutive notifications contain \"close\" with no intervening \"open\", the implementation prevents runaway double-counting by applying a reasonable de-duplication/debounce rule (e.g., count only on first \"close\" until an \"open\" is seen, or impose a minimum time gap).",
        "Existing numeric light-level based open→closed transition detection continues to function as it does today for numeric payloads.",
        "No changes are required to backend storage/APIs for this behavior; the change is limited to the frontend BLE parsing/detection flow (e.g., in `frontend/src/contexts/BluetoothContext.tsx`, and related parsing utilities if needed)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/utils/bleNus.ts",
          "operation": "modify",
          "description": "Add a small parsing helper for decoded UTF-8 BLE text notifications to detect eye-state tokens (at minimum: case-insensitive match for \"close\", optionally \"open\") without requiring a numeric value, so higher-level BLE handlers can map token presence to an eye state."
        },
        {
          "path": "frontend/src/contexts/BluetoothContext.tsx",
          "operation": "modify",
          "description": "Update the BLE notification handler to (1) detect a decoded-text eye-state token \"close\" (case-insensitive) and treat it as an eye-closed state, (2) record a blink into the existing 60-second rolling window when transitioning into closed based on token detection even if no numeric value is parsed, and (3) prevent double-counting by de-duplicating consecutive \"close\" notifications (e.g., count only on first close until an \"open\" token or a numeric open state is observed). Ensure the existing numeric light-level open→closed transition detection path remains unchanged for numeric payloads and that token-based detection does not cause an additional count for the same notification."
        }
      ]
    }
  ]
}